; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l5-t1-p2---int100n150-m25---int100c150---s13---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 - location
t0 - truck
p0 p1 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 - fuellevel
)

(:init
(sum level0 level1 level1)
(sum level0 level2 level2)
(sum level0 level9 level9)
(sum level0 level19 level19)
(sum level0 level20 level20)
(sum level0 level22 level22)
(sum level1 level1 level2)
(sum level1 level2 level3)
(sum level1 level9 level10)
(sum level1 level19 level20)
(sum level1 level20 level21)
(sum level1 level22 level23)
(sum level2 level1 level3)
(sum level2 level2 level4)
(sum level2 level9 level11)
(sum level2 level19 level21)
(sum level2 level20 level22)
(sum level2 level22 level24)
(sum level3 level1 level4)
(sum level3 level2 level5)
(sum level3 level9 level12)
(sum level3 level19 level22)
(sum level3 level20 level23)
(sum level3 level22 level25)
(sum level4 level1 level5)
(sum level4 level2 level6)
(sum level4 level9 level13)
(sum level4 level19 level23)
(sum level4 level20 level24)
(sum level5 level1 level6)
(sum level5 level2 level7)
(sum level5 level9 level14)
(sum level5 level19 level24)
(sum level5 level20 level25)
(sum level6 level1 level7)
(sum level6 level2 level8)
(sum level6 level9 level15)
(sum level6 level19 level25)
(sum level7 level1 level8)
(sum level7 level2 level9)
(sum level7 level9 level16)
(sum level8 level1 level9)
(sum level8 level2 level10)
(sum level8 level9 level17)
(sum level9 level1 level10)
(sum level9 level2 level11)
(sum level9 level9 level18)
(sum level10 level1 level11)
(sum level10 level2 level12)
(sum level10 level9 level19)
(sum level11 level1 level12)
(sum level11 level2 level13)
(sum level11 level9 level20)
(sum level12 level1 level13)
(sum level12 level2 level14)
(sum level12 level9 level21)
(sum level13 level1 level14)
(sum level13 level2 level15)
(sum level13 level9 level22)
(sum level14 level1 level15)
(sum level14 level2 level16)
(sum level14 level9 level23)
(sum level15 level1 level16)
(sum level15 level2 level17)
(sum level15 level9 level24)
(sum level16 level1 level17)
(sum level16 level2 level18)
(sum level16 level9 level25)
(sum level17 level1 level18)
(sum level17 level2 level19)
(sum level18 level1 level19)
(sum level18 level2 level20)
(sum level19 level1 level20)
(sum level19 level2 level21)
(sum level20 level1 level21)
(sum level20 level2 level22)
(sum level21 level1 level22)
(sum level21 level2 level23)
(sum level22 level1 level23)
(sum level22 level2 level24)
(sum level23 level1 level24)
(sum level23 level2 level25)
(sum level24 level1 level25)

(connected l0 l1)
(fuelcost level1 l0 l1)
(connected l0 l2)
(fuelcost level22 l0 l2)
(connected l0 l4)
(fuelcost level2 l0 l4)
(connected l1 l0)
(fuelcost level1 l1 l0)
(connected l1 l3)
(fuelcost level20 l1 l3)
(connected l1 l4)
(fuelcost level19 l1 l4)
(connected l2 l0)
(fuelcost level22 l2 l0)
(connected l2 l3)
(fuelcost level9 l2 l3)
(connected l2 l4)
(fuelcost level20 l2 l4)
(connected l3 l1)
(fuelcost level20 l3 l1)
(connected l3 l2)
(fuelcost level9 l3 l2)
(connected l4 l0)
(fuelcost level2 l4 l0)
(connected l4 l1)
(fuelcost level19 l4 l1)
(connected l4 l2)
(fuelcost level20 l4 l2)

(at t0 l0)
(fuel t0 level9)
(= (total-cost) 0)

(at p0 l4)
(at p1 l1)
)

(:goal
(and
(at p0 l0)
(at p1 l4)
)
)
(:metric minimize (total-cost)))

; plan
1. (drive t0 l0 l1 level8 level1 level9)
   deleted: (at t0 l0) (fuel t0 level9)
   added: (at t0 l1) (fuel t0 level8)
   goals met: 0 of 2
2. (load p1 t0 l1)
   deleted: (at p1 l1)
   added: (in p1 t0)
   goals met: 0 of 2
3. (drive t0 l1 l0 level7 level1 level8)
   deleted: (at t0 l1) (fuel t0 level8)
   added: (at t0 l0) (fuel t0 level7)
   goals met: 0 of 2
4. (drive t0 l0 l4 level5 level2 level7)
   deleted: (at t0 l0) (fuel t0 level7)
   added: (at t0 l4) (fuel t0 level5)
   goals met: 0 of 2
5. (load p0 t0 l4)
   deleted: (at p0 l4)
   added: (in p0 t0)
   goals met: 0 of 2
6. (unload p1 t0 l4)
   deleted: (in p1 t0)
   added: (at p1 l4)
   goals met: 1 of 2
7. (drive t0 l4 l0 level3 level2 level5)
   deleted: (at t0 l4) (fuel t0 level5)
   added: (at t0 l0) (fuel t0 level3)
   goals met: 1 of 2
8. (unload p0 t0 l0)
   deleted: (in p0 t0)
   added: (at p0 l0)
   goals met: 2 of 2
